#+TITLE: Valid Palindrome
#+DATE: <2026-06-06>
#+FILETAGS: :neetcode:two_pointers:
#+PROPERTY: header-args :results output :session *shared*

** Solution

#+begin_src python

s = "Was it a car or a cat I saw?"

def is_palindrome(s):
    start, end = 0, len(s) - 1
    while not end < start:
        while not end < start and not s[end].isalnum(): end -= 1
        while not start > end and not s[start].isalnum(): start += 1
        if end < start:
            return True
        if s[start].lower() == s[end].lower():
            start += 1
            end -= 1
        else:
            return False
    return True
        
print(is_palindrome(s)) # True

s = "tab a cat"

print(is_palindrome(s)) # False

print(is_palindrome("!!??"))  # True


#+end_src

#+RESULTS:
: True
: False
: True

